#include <iostream>


int main(int argc, char** argv)
{
    /*
        1. 指针常量，const修饰的是常量
        特点：指针的指向不可以修改，指针指向的值可以修改
    */
    int a1 = 10;
    int b1 = 20;

    int * const p1 = &a1;
    // p1 = &b1;  // 错误。指针的指向不可以修改
    *p1 = b1;  // 正确。指针指向的值可以修改

    /*
        2.常量指针，const修饰的是指针
        特点：指针指向的值不可以修改，指针的指向可以修改
    */
    int a2 = 10;
    int b2 = 20;

    const int * p2 = &a2;
    p2 = &b2;  // 正确。指针的指向可以修改
    // *p2 = b2;  // 错误。指针指向的值不可以修改

    /*
        3.const既修饰指针，又修饰常量
        特点：指针的指向不可以修改，指针指向的值也不可以修改
    */
    int a3 = 10;
    int b3 = 20;

    const int * const p3 = &a3;
    // p3 = &b3;  // 错误。指针的指向不可以修改
    // *p3 = b3;  // 错误。指针指向的值不可以修改

    return 0;
}